define(function(require, exports, module){
	var blog_2014_06_21 = {
		id:'blog_2014_06_21',
		title: '<a class="title_a" href="article.html?id=blog_2014_06_21">大学这四年</a>',
		blog_tags: ['大学四年', '总结' , '展望'],
		blog_time: '2014-06-21 凌晨1点',
		blog_p:[
			{
				title: '四年前的事儿',
				content:[ 
				'四年前，我并不知道自己会学计算机(其实，我的专业是GIS)，进入IT，进入互联网。在四年前，我还是一个刚刚带有文艺色彩的小青年，不知道技术，不知道工程和项目，也不知道算法和数据分析等等。偶尔，写两句小话，就美得屁颠的。四年后的今天，我觉得我自己应该是喜欢计算机了，喜欢上了研发。话说，第一次接触计算机(哦，对，那时我叫它为电脑,好幼稚呀)应该是7年前。2007年，中考考的还可以，进入安徽省最好的高中——安庆一中(貌似，连续几年全国公布的数据，都是全国第六)读书。那之前，可还是土包子啊，没有摸过键盘和鼠标。不过重点中学的条件就是好，开始听了一些计算机的课程，其实也就是office居多，不过VB倒是讲了几节课。可惜当时没理解多少啊。现在，真的很怀念一中，怀念一中的同学们。大学里养成的良好习惯，还是一中给予的，犹记得门前的罗汉松。不过还记得慈云桂院士(中国科学院院士,主持研制了我国第一台亿次级巨型计算机系统)是校友，那大学学计算机的时候想想，还是有一定的向往的。在开发第一个全前端blog show程序，我首先谢谢一中给了我一份追求上进的精神。',
				'2010年，进入了一所的二本院校，想都没想过的事，但是命运却到了这里戛然而止。或许，这次考验是正确的，最好的方式去激励我。回想，过去四年的大学，我真心无悔，只是觉得时间太短，韶华易逝。2010年，初入大学，什么都不懂。这一年，反正就是乖乖学生，好好上课。2011年，拿了一等奖学金，当我准备考虑用这钱干什么事的时候，我做了一个正确的决定，那就是买PC。买PC的时候，我说是为了学习编程，好多人以为我也是一时心热而已。但是，经过一年的时间，我都在学习，没有玩过网游等等。记得大二的寒假，过年我都在写代码，父亲都劝我出来活动活动。对于，当年拿奖学金买电脑的举动，我现在还感谢那时候的自己。刚开始，写代码是从C语言开始的，大概写了有两个月的时间吧。后来开始写一些C++，因为上课安排是C++ OOP这门课程。学了一些C++ OOP的时候，开始了一点编程的感觉，于是找学长借了本C#的书，开始学习OOP和WinForm程序设计，可以开始做一些小东西了。记得，当时，是大二做了一个班级管理系统，WF+SQL Server实现的，第一个版本就发给老师了。编程的兴趣开始渐渐浓厚。大二的下学期，开始泡在图书管理，看一些Web开发方面的书，当然是继承一条线路是ASP.NET。其实，没学多少ASP.NET，倒是手写了不少的HTML+DIV+CSS的东西，不过js真心不会，只会用Jquery。于是使用.NET做服务端，HTML+DIV+CSS+JS做前端做一些小的玩具项目。因为，当时觉得ASP的apsx太不灵活，且生成代码太多，一改就乱，于是选择HTML，这也是如今我选择框架的考量因素之一：不能有太多的自动生成代码，必须灵活配置和方便读懂每一句代码，以防止无厘头的bug。大二暑假到了，北京一家做C++的公司来招实习生，那时，在写.NET(应该是c#，因为我没写aspx...呜...)啦，C++好长一段时间没写了。但是听说，这家公司是这次来招实习生最好的一家的公司。果真，系里大部分都投了这家公司，于是，决定参加笔试，其实笔试题真不难。结果出来了，共发了4个offer,我拿到了其中一个。于是，暑假就去实习了。暑假的实习给我一个重要的启示就是，做自己喜欢的事，选择自己感兴趣的方向，而我不想做桌面开发。于是，实习回到学校后，一如既往学习web开发。',
				'看了一些网站的论坛，说学习web，就要学习JAVA，于是一头扎进了JAVA，学习JAVA的基础知识和JSP，Servlet等，当然也觉得将C#、C++和JAVA的基础知识学习了之后，有一个好处就是基础性的东西有了，后面的开发逻辑也就更有感觉啦。我是一个不急于学习框架的人，因为我个人觉得把原理弄会了，框架学习起来应该还是蛮顺手的。大三学习编程的时间真不多了，都是在一些小项目中度过。大三下学期，整个人都投入到了比赛中，当然也拿到了安徽省第一名的好成绩，也感谢导师的指导。这期间开始接触了NoSQL，LBS，中文分词一些理论和工具，于是做了一些MongoDB的开发。大三暑假，给导师在一个公司做项目，也是最花时间的，因为项目的需求很慢，整个人也被拖着，想学习的时间也不多。慢慢的，那时候感觉大学真的快毕业啦！',
				'2013年9月份，因为教育部本科评估，学生都不能离校，连放假都要在半天能赶回来的地方。9-11月这段期间，因为评估和论文开题，错过了很多校招的机会，因为，校招都安排在南京、上海、合肥等，但是，不能离校啊。收到过一些网申的笔试通知也没去，索性都放弃网申了。暑假认识了高德地图的一个经理，经过内推获得了校招的面试，于是11月份，启程去了北京参加笔试和面试，当然去北京之前也有电话面试等，这也说明一个公司负责任的态度，不可能让我大老远跑去。在高德地图经过一天四轮的考察，拿到的web研发的offer。在拿到高德地图的offer之前，也拿到了南京和上海的offer,一个是通信行业，一个是做.NET的，虽然待遇跟高德差不多，但是没有选择。我知道自己的目标是跟LBS结合紧密一点的公司，因为毕竟是GIS出身，当然个人本身对.NET的代码生成很不喜欢。于是，最终offer的确定就是高德地图，后面的其他面试机会都没有考虑。',
				'2013年11月18日，第二次来到北京，开始了毕业实习。毕业实习做的是Node.js的后端和部分前端。这次的实习收获最大，有3点：(1)学习了Node.js，当然对于没有JS扎实基础的哦，需要适应。(2)了解web app,知道了模块化开发和模板渲染，这也是会学校后开始学习的，再看公司的代码，有了些感觉。同时，一个后端开始了前端学习之旅，学习时很迷茫，渐渐薄雾见青天。学习JS的面向对象，学习前端的框架等(3)有一个年轻的leader和团队，让我觉得互联网公司的可爱和积极，也是我第一份工作的最好开始。'
				]
			},
			{
				title: '四年后的事儿',
				content:[
				'我要感谢我的女朋友，四年下来，谢谢她的理解，因为大部分时间放在学习和写代码上，没多少时间陪她，谢谢她的支持。同时，也谢谢父亲没有一直坚持让我去考公务员，因为实在不感冒啦。也感谢大学四年的自己，努力换来的一叠叠证书，一个个荣誉，感谢年轻的自己在大学奋斗过。感谢大学的师长的关照的鼓励，Thanks for all.', 
				'2014年7月1日，即将启程去北京，正式入职。如果现在问我，一个后端愿意写前端吗，我会肯定的说我愿意。因为，我开始喜欢上了前端。同时，将来，不是更需要全端工程师么，就像师傅W说的，前后端都要会，现在，我十分赞同。我希望2年后的自己能有一个很大的提升，我希望四年后自己有一个可以拿的出手的项目。'
				]
			}
		]
	};



	
	exports.blog_2014_06_21 = blog_2014_06_21;


});


