define(function(require, exports, module){
	var blog_2014_06_21_am_1 = {
		title: '大学这四年',
		blog_tags: ['大学四年', '总结' , '展望'],
		blog_time: '2014-06-21 凌晨1点',
		blog_p:[
			{
				title: '四年前的事儿',
				content:[ 
				'四年前，我并不知道自己会学计算机(其实，我的专业是GIS)，进入IT，进入互联网。在四年前，我还是一个刚刚带有文艺色彩的小青年，不知道技术，不知道工程和项目，也不知道算法和数据分析等等。偶尔，写两句小话，就美得屁颠的。四年后的今天，我觉得我自己应该是喜欢计算机了，喜欢上了研发。话说，第一次接触计算机(哦，对，那时我叫它为电脑,好幼稚呀)应该是7年前。2007年，中考考的还可以，进入安徽省最好的高中——安庆一中(貌似，连续几年全国公布的数据，都是全国第六)读书。那之前，可还是土包子啊，没有摸过键盘和鼠标。不过重点中学的条件就是好，开始听了一些计算机的课程，其实也就是office居多，不过VB倒是讲了几节课。可惜当时没理解多少啊。现在，真的很怀念一中，怀念一中的同学们。大学里养成的良好习惯，还是一中给予的，犹记得门前的罗汉松。不过还记得慈云桂院士(中国科学院院士,主持研制了我国第一台亿次级巨型计算机系统)是校友，那大学学计算机的时候想想，还是有一定的向往的。在开发第一个全前端blog show程序，我首先谢谢一中给了我一份追求上进的精神。',
				'四年前，我并不知道自己会学计算机(其实，我的专业是GIS)，进入IT，进入互联网。在四年前，我还是一个刚刚带有文艺色彩的小青年，不知道技术，不知道工程和项目，也不知道算法和数据分析等等。偶尔，写两句小话，就美得屁颠的'
				]
			}
		]
	};



	var blog_2014_06_21_am_2 = {
		title: '大学这四年',
		blog_tags: ['大学四年', '总结' , '展望'],
		blog_time: '2014-06-21 凌晨1点',
		blog_p:[
			{
				title: '四年前的事儿',
				content:[ 
				'四年前，我并不知道自己会学计算机(其实，我的专业是GIS)，进入IT，进入互联网。在四年前，我还是一个刚刚带有文艺色彩的小青年，不知道技术，不知道工程和项目，也不知道算法和数据分析等等。偶尔，写两句小话，就美得屁颠的。四年后的今天，我觉得我自己应该是喜欢计算机了，喜欢上了研发。话说，第一次接触计算机(哦，对，那时我叫它为电脑,好幼稚呀)应该是7年前。2007年，中考考的还可以，进入安徽省最好的高中——安庆一中(貌似，连续几年全国公布的数据，都是全国第六)读书。那之前，可还是土包子啊，没有摸过键盘和鼠标。不过重点中学的条件就是好，开始听了一些计算机的课程，其实也就是office居多，不过VB倒是讲了几节课。可惜当时没理解多少啊。现在，真的很怀念一中，怀念一中的同学们。大学里养成的良好习惯，还是一中给予的，犹记得门前的罗汉松。不过还记得慈云桂院士(中国科学院院士,主持研制了我国第一台亿次级巨型计算机系统)是校友，那大学学计算机的时候想想，还是有一定的向往的。在开发第一个全前端blog show程序，我首先谢谢一中给了我一份追求上进的精神。',
				'四年前，我并不知道自己会学计算机(其实，我的专业是GIS)，进入IT，进入互联网。在四年前，我还是一个刚刚带有文艺色彩的小青年，不知道技术，不知道工程和项目，也不知道算法和数据分析等等。偶尔，写两句小话，就美得屁颠的'
				]
			}
		]
	};

	exports.blog_2014_06_21_am_1 = blog_2014_06_21_am_1;
	exports.blog_2014_06_21_am_2 = blog_2014_06_21_am_2;

});


